package com.springapp.mvc.domain;

import com.springapp.mvc.pojo.University;
import com.springapp.mvc.util.HibernateUtil;
import org.hibernate.Criteria;
import org.hibernate.Session;
import org.hibernate.criterion.Restrictions;
import org.springframework.stereotype.Service;

import java.util.List;

/**
 * Created by Pongpipat on 9/2/2558.
 */
@Service
public class QueryUniversityDomain extends HibernateUtil{
    public List<University> getAllUniversity(){
        Session session = getSession();
        Criteria criteria = session.createCriteria(University.class);
        List<University> list = criteria.list();
        return list;

    }
    public List<University> quryUniversityLike(String universityname){
        Criteria criteria = getSession().createCriteria(University.class);
        criteria.add(Restrictions.like("university_name","%"+universityname+"%"));
        List<University> list = criteria.list();
        closeSession();
        return list;
    }
    public void InsertUni(){
        String string[] = {
                "มหาวิทยาลัยรามคำแหง",
                "มหาวิทยาลัยศรีนครินทรวิโรฒ",
                "มหาวิทยาลัยศิลปากร",
                "มหาวิทยาลัยสงขลานครินทร์",
                "มหาวิทยาลัยสุโขทัยธรรมาธิราช",
                "มหาวิทยาลัยอุบลราชธานี",
                "จุฬาลงกรณ์มหาวิทยาลัย",
                "มหาวิทยาลัยเชียงใหม่",
                "มหาวิทยาลัยทักษิณ",
                "มหาวิทยาลัยนวมินทราธิราช",
                "มหาวิทยาลัยบูรพา",
                "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี",
                "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ",
                "มหาวิทยาลัยเทคโนโลยีสุรนารี",
                "มหาวิทยาลัยพะเยา",
                "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย",
                "มหาวิทยาลัยมหามกุฏราชวิทยาลัย",
                "มหาวิทยาลัยมหิดล",
                "มหาวิทยาลัยแม่ฟ้าหลวง",
                "มหาวิทยาลัยวลัยลักษณ์",
                "มหาวิทยาลัยราชภัฏกาญจนบุรี",
                "มหาวิทยาลัยราชภัฏกาฬสินธุ์",
                "มหาวิทยาลัยราชภัฏกำแพงเพชร",
                "มหาวิทยาลัยราชภัฏจันทรเกษม",
                "มหาวิทยาลัยราชภัฏชัยภูมิ",
                "มหาวิทยาลัยราชภัฏเชียงราย",
                "มหาวิทยาลัยราชภัฏเชียงใหม่",
                "มหาวิทยาลัยราชภัฏเทพสตรี",
                "มหาวิทยาลัยราชภัฏธนบุรี",
                "มหาวิทยาลัยราชภัฏนครปฐม",
                "มหาวิทยาลัยราชภัฏนครราชสีมา",
                "มหาวิทยาลัยราชภัฏนครศรีธรรมราช",
                "มหาวิทยาลัยราชภัฏนครสวรรค์",
                "มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา",
                "มหาวิทยาลัยราชภัฏบึงกาฬ (กำลังรออนุมัติ)",
                "มหาวิทยาลัยราชภัฏบุรีรัมย์",
                "มหาวิทยาลัยราชภัฏพระนคร",
                "มหาวิทยาลัยราชภัฏพระนครศรีอยุธยา",
                "มหาวิทยาลัยราชภัฏพิบูลสงคราม",
                "มหาวิทยาลัยราชภัฏเพชรบุรี",
                "มหาวิทยาลัยราชภัฏเพชรบูรณ์",
                "มหาวิทยาลัยราชภัฏภูเก็ต",
                "มหาวิทยาลัยราชภัฏมหาสารคาม",
                "มหาวิทยาลัยราชภัฏยะลา",
                "มหาวิทยาลัยราชภัฏร้อยเอ็ด",
                "มหาวิทยาลัยราชภัฏราชนครินทร์",
                "มหาวิทยาลัยราชภัฏรำไพพรรณี",
                "มหาวิทยาลัยราชภัฏลำปาง",
                "มหาวิทยาลัยราชภัฏเลย",
                "มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์",
                "มหาวิทยาลัยราชภัฏศรีสะเกษ",
                "มหาวิทยาลัยราชภัฏสกลนคร",
                "มหาวิทยาลัยราชภัฏสงขลา",
                "มหาวิทยาลัยราชภัฏสวนดุสิต",
                "มหาวิทยาลัยราชภัฏสวนสุนันทา",
                "มหาวิทยาลัยราชภัฏสุราษฎร์ธานี",
                "มหาวิทยาลัยราชภัฏสุรินทร์",
                "มหาวิทยาลัยราชภัฏหมู่บ้านจอมบึง",
                "มหาวิทยาลัยราชภัฏอุดรธานี",
                "มหาวิทยาลัยราชภัฏอุตรดิตถ์",
                "มหาวิทยาลัยราชภัฏอุบลราชธานี",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ",
                "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน",
                "สถาบันดนตรีกัลยาณิวัฒนา",
                "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง",
                "สถาบันการบินพลเรือน",
                "สถาบันการพลศึกษา",
                "สถาบันเทคโนโลยีปทุมวัน",
                "สถาบันบัณฑิตพัฒนบริหารศาสตร์",
                "สถาบันบัณฑิตพัฒนศิลป์",
                "สถาบันพระบรมราชชนก",
                "วิทยาลัยพยาบาลกองทัพบก",
                "วิทยาลัยพยาบาลกองทัพเรือ",
                "วิทยาลัยพยาบาลตำรวจ",
                "วิทยาลัยพยาบาลทหารอากาศ",
                "วิทยาลัยพยาบาลสภากาชาดไทย",
                "วิทยาลัยแพทยศาสตร์พระมงกุฎเกล้า",
                "ศูนย์ฝึกพาณิชย์นาวี",
                "โรงเรียนนายร้อยตำรวจ",
                "โรงเรียนนายร้อยพระจุลจอมเกล้า",
                "โรงเรียนนายเรือ",
                "โรงเรียนนายเรืออากาศนวมินทกษัตริยาธิราช",
                "มหาวิทยาลัยกรุงเทพ",
                "มหาวิทยาลัยกรุงเทพธนบุรี",
                "มหาวิทยาลัยการจัดการและเทคโนโลยีอีสเทิร์น",
                "มหาวิทยาลัยเกริก",
                "มหาวิทยาลัยเกษมบัณฑิต",
                "มหาวิทยาลัยคริสเตียน",
                "มหาวิทยาลัยเฉลิมกาญจนา",
                "มหาวิทยาลัยตาปี",
                "มหาวิทยาลัยเจ้าพระยา",
                "มหาวิทยาลัยชินวัตร",
                "มหาวิทยาลัยเซนต์จอห์น",
                "มหาวิทยาลัยเทคโนโลยีมหานคร",
                "มหาวิทยาลัยธนบุรี",
                "มหาวิทยาลัยธุรกิจบัณฑิตย์",
                "มหาวิทยาลัยนอร์ทกรุงเทพ",
                "มหาวิทยาลัยนอร์ท-เชียงใหม่",
                "มหาวิทยาลัยนานาชาติแสตมฟอร์ด",
                "มหาวิทยาลัยนานาชาติเอเชีย-แปซิฟิก",
                "มหาวิทยาลัยเนชั่น",
                "มหาวิทยาลัยปทุมธานี",
                "มหาวิทยาลัยพายัพ",
                "มหาวิทยาลัยพิษณุโลก",
                "มหาวิทยาลัยฟาร์อีสเทอร์น",
                "มหาวิทยาลัยภาคกลาง",
                "มหาวิทยาลัยภาคตะวันออกเฉียงเหนือ",
                "มหาวิทยาลัยรังสิต",
                "มหาวิทยาลัยรัตนบัณฑิต",
                "มหาวิทยาลัยราชธานี",
                "มหาวิทยาลัยวงษ์ชวลิตกุล",
                "มหาวิทยาลัยเวบสเตอร์ (ประเทศไทย)",
                "มหาวิทยาลัยเวสเทิร์น",
                "มหาวิทยาลัยศรีปทุม",
                "มหาวิทยาลัยสยาม",
                "มหาวิทยาลัยหอการค้าไทย",
                "มหาวิทยาลัยหัวเฉียวเฉลิมพระเกียรติ",
                "มหาวิทยาลัยหาดใหญ่",
                "มหาวิทยาลัยอัสสัมชัญ",
                "มหาวิทยาลัยฟาฏอนี",
                "มหาวิทยาลัยอีสเทิร์นเอเชีย",
                "มหาวิทยาลัยเอเชียน",
                "มหาวิทยาลัยเอเชียอาคเนย์",
                "สถาบันกันตนา",
                "สถาบันการจัดการปัญญาภิวัฒน์",
                "สถาบันการเรียนรู้เพื่อปวงชน",
                "สถาบันเทคโนโลยีไทย-ญี่ปุ่น",
                "สถาบันเทคโนโลยีแห่งอโยธยา",
                "สถาบันเทคโนโลยีแห่งเอเชีย",
                "สถาบันบัณฑิตศึกษาจุฬาภรณ์",
                "สถาบันเทคโนโลยียานยนต์มหาชัย",
                "สถาบันรัชต์ภาคย์",
                "สถาบันอาศรมศิลป์",
                "วิทยาลัยกรุงเทพสุวรรณภูมิ",
                "วิทยาลัยเชียงราย",
                "วิทยาลัยเซนต์หลุยส์",
                "วิทยาลัยเซาธ์อีสบางกอก",
                "วิทยาลัยดุสิตธานี",
                "วิทยาลัยทองสุข",
                "วิทยาลัยเทคโนโลยีจิตรลดา",
                "วิทยาลัยเทคโนโลยีพนมวันท์",
                "วิทยาลัยเทคโนโลยีภาคใต้",
                "วิทยาลัยเทคโนโลยีสยาม",
                "วิทยาลัยเทคโนโลยีสยาม (สยามเทค)",
                "วิทยาลัยนครราชสีมา",
                "วิทยาลัยนานาชาติเซนต์เทเรซา",
                "วิทยาลัยบัณฑิตเอเชีย",
                "วิทยาลัยพิชญบัณฑิต",
                "วิทยาลัยพุทธศาสนานานาชาติ",
                "วิทยาลัยราชพฤกษ์",
                "วิทยาลัยลุ่มน้ำปิง",
                "วิทยาลัยสันตพล",
                "วิทยาลัยแสงธรรม",
                "วิทยาลัยอินเตอร์เทคลำปาง"};

        for (int i=0;i<string.length;i++) {
            HibernateUtil.beginTransaction();

            //Add new Employee object
            University emp = new University();
            emp.setUniversity_name(string[i]);

            //Save the employee in database
            getSession().save(emp);

            //Commit the transaction
            HibernateUtil.commitTransaction();
            //HibernateUtil.shutdown();
            closeSession();

        }


    }
}
